# 2. Напишите программу, которая найдёт произведение пар чисел списка.
#  Парой считаем первый и последний элемент, второй и предпоследний и т.д.

import math

sp_1 = [2, 3, 4, 5, 6]
sp_2 = [2, 3, 5, 6]
sp = input('Введите номер списка:  ')
if sp == '1': sp = sp_1
if sp == '2': sp = sp_2

n = math.ceil(len(sp) / 2)
pr = [sp[i] * sp[len(sp) - 1 - i] for i in range(n)]
print(f'{sp} => {pr}')    

# *************** Вывод в терминал *************
# Введите номер списка:  1
# [2, 3, 4, 5, 6] => [12, 15, 16]

# Введите номер списка:  2
# [2, 3, 5, 6] => [12, 15]