# 3.2. Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д

sp = input('Введите номер списка:  ')
if sp == '1': sp = [2, 3, 4, 5, 6]
if sp == '2': sp = [2, 3, 5, 6]

d = int(round((len(sp) + 1) / 2))
print(f'{sp} => {[a * b for a, b in zip(sp[:d], sp[d + 1::-1])]}')
# *************** Вывод в терминал *************
# Введите номер списка:  1
# [2, 3, 4, 5, 6] => [12, 15, 16]

# Введите номер списка:  2
# [2, 3, 5, 6] => [12, 15]